src/cf/InformationRegisters/fmModelsSelectionSetting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmModelsSelectionSetting</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AgreementRoute</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmAgreementRoutes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>AmountTo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentType</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.fmAgreeDocumentTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AmountFrom</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/fmModelsSelectionSetting/Ext/RecordSetModule.bsl
// Процедура - обработчик события объекта "ПередЗаписью"
//
Procedure BeforeWrite(Cancel, Replacement)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	For Each CurRecord In ThisObject Do
		Query = New Query;
		Query.Text = "SELECT ALLOWED
		               |	ModelsSelectionSetting.AgreementRoute,
		               |	ModelsSelectionSetting.DocumentType,
		               |	ModelsSelectionSetting.OperationType,
		               |	ModelsSelectionSetting.BalanceUnit,
		               |	ModelsSelectionSetting.Department,
		               |	ModelsSelectionSetting.AmountFrom,
		               |	ModelsSelectionSetting.Currency,
		               |	ModelsSelectionSetting.AmountTo
		               |FROM
		               |	InformationRegister.fmModelsSelectionSetting AS ModelsSelectionSetting
		               |WHERE
		               |	ModelsSelectionSetting.BalanceUnit = &BalanceUnit
		               |	AND ModelsSelectionSetting.DocumentType = &DocumentType
		               |	AND ModelsSelectionSetting.OperationType = &OperationType
		               |	AND ModelsSelectionSetting.Department = &Department
		               |	AND ModelsSelectionSetting.Currency = &Currency
		               |	AND (NOT(ModelsSelectionSetting.AmountFrom < &AmountFrom
		               |					AND ModelsSelectionSetting.AmountTo < &AmountFrom
		               |				OR ModelsSelectionSetting.AmountFrom > &AmountTo
		               |					AND ModelsSelectionSetting.AmountTo > &AmountTo))
		               |	AND ModelsSelectionSetting.AmountFrom <> &AmountFrom";
		
		Query.Parameters.Insert("BalanceUnit", CurRecord.BalanceUnit);
		Query.Parameters.Insert("Department", CurRecord.Department);
		Query.Parameters.Insert("DocumentType", CurRecord.DocumentType);
		Query.Parameters.Insert("OperationType", CurRecord.OperationType);
		Query.Parameters.Insert("Currency", CurRecord.Currency);
		Query.Parameters.Insert("AmountFrom", CurRecord.AmountFrom);
		Query.Parameters.Insert("AmountTo", CurRecord.AmountTo);
		
		Selection = Query.Execute().SELECT();
		If Selection.Next() Then
			CommonClientServer.MessageToUser("Некорректно введены сумма от и до! Пересекаются интервалы с ранее введенными записями!", , , , , Cancel);
		EndIf;
	EndDo;
	
EndProcedure // ПередЗаписью()
